Metamorphos-1-s/stm32f103rbt6_a33/Protocol/modbus/modbus_register_map.h
#ifndef MODBUS_REGISTER_MAP_H
#define MODBUS_REGISTER_MAP_H

#define MODBUS_REGISTER_MAP_VERSION 0x0104U
#define MODBUS_REALTIME_FIRST 0x0000U
#define MODBUS_REALTIME_LAST 0x001FU
#define MODBUS_DIAGNOSTIC_FIRST 0x0020U
#define MODBUS_DIAGNOSTIC_LAST 0x003FU
#define MODBUS_MAILBOX_FIRST 0x0040U
#define MODBUS_MAILBOX_LAST 0x005FU
#define MODBUS_ACTIVE_CONFIG_FIRST 0x0100U
#define MODBUS_ACTIVE_CONFIG_LAST 0x013FU
#define MODBUS_STAGING_CONFIG_FIRST 0x0140U
#define MODBUS_STAGING_CONFIG_LAST 0x017FU
#define MODBUS_CALIBRATION_FIRST 0x0180U
#define MODBUS_CALIBRATION_LAST 0x019FU
#define MODBUS_COMMUNICATION_FIRST 0x01A0U
#define MODBUS_COMMUNICATION_LAST 0x01BFU
#define MODBUS_STORAGE_FIRST 0x01C0U
#define MODBUS_STORAGE_LAST 0x01DFU
#define MODBUS_SAVE_RESULT 0x01C5U
#define MODBUS_SAVE_TOKEN 0x01C6U
#define MODBUS_SAVE_SOURCE 0x01C7U
#define MODBUS_SAVE_REVISION_FIRST 0x01C8U
#define MODBUS_SAVE_REVISION_LAST 0x01C9U
#define MODBUS_DISPLAY_CONDITION_FIRST 0x01E0U
#define MODBUS_DISPLAY_CONDITION_LAST 0x01F0U
#define MODBUS_DISPLAY_CONDITION_STATE 0x01E0U
#define MODBUS_DISPLAY_CONDITION_LOCKED 0x01E1U
#define MODBUS_DISPLAY_CONDITION_MASS_FIRST 0x01E2U
#define MODBUS_DISPLAY_CONDITION_ANCHOR_FIRST 0x01E6U
#define MODBUS_DISPLAY_CONDITION_THRESHOLD_FIRST 0x01EAU
#define MODBUS_DISPLAY_CONDITION_ELAPSED_FIRST 0x01EEU
#define MODBUS_DISPLAY_CONDITION_RELEASE_REASON 0x01F0U
#define MODBUS_RUNTIME_DRIFT_FIRST 0x0200U
#define MODBUS_RUNTIME_DRIFT_LAST 0x021DU
#define MODBUS_RUNTIME_DRIFT_STATE 0x0200U
#define MODBUS_RUNTIME_DRIFT_ENABLED 0x0201U
#define MODBUS_RUNTIME_DRIFT_LIMITED 0x0202U
#define MODBUS_RUNTIME_DRIFT_RESERVED 0x0203U
#define MODBUS_RUNTIME_DRIFT_OFFSET_FIRST 0x0204U
#define MODBUS_RUNTIME_DRIFT_OFFSET_LAST 0x0207U
#define MODBUS_RUNTIME_DRIFT_UNCOMPENSATED_FIRST 0x0208U
#define MODBUS_RUNTIME_DRIFT_UNCOMPENSATED_LAST 0x020BU
#define MODBUS_RUNTIME_DRIFT_COMPENSATED_FIRST 0x020CU
#define MODBUS_RUNTIME_DRIFT_COMPENSATED_LAST 0x020FU
#define MODBUS_RUNTIME_DRIFT_REFERENCE_FIRST 0x0210U
#define MODBUS_RUNTIME_DRIFT_REFERENCE_LAST 0x0213U
#define MODBUS_RUNTIME_DRIFT_ERROR_FIRST 0x0214U
#define MODBUS_RUNTIME_DRIFT_ERROR_LAST 0x0217U
#define MODBUS_RUNTIME_DRIFT_ARMING_ELAPSED_FIRST 0x0218U
#define MODBUS_RUNTIME_DRIFT_ARMING_ELAPSED_LAST 0x0219U
#define MODBUS_RUNTIME_DRIFT_WINDOW_ELAPSED_FIRST 0x021AU
#define MODBUS_RUNTIME_DRIFT_WINDOW_ELAPSED_LAST 0x021BU
#define MODBUS_RUNTIME_DRIFT_SAMPLE_COUNT_FIRST 0x021CU
#define MODBUS_RUNTIME_DRIFT_SAMPLE_COUNT_LAST 0x021DU
#define MODBUS_ALARM_ACTIVE_FIRST 0x0220U
#define MODBUS_ALARM_ACTIVE_LAST 0x023FU
#define MODBUS_ALARM_STAGING_FIRST 0x0240U
#define MODBUS_ALARM_STAGING_LAST 0x025FU
#define MODBUS_ALARM_LIMIT_ENABLE 0x0220U
#define MODBUS_ALARM_WEIGHT_SOURCE 0x0221U
#define MODBUS_ALARM_LOWER_LIMIT_FIRST 0x0222U
#define MODBUS_ALARM_UPPER_LIMIT_FIRST 0x0226U
#define MODBUS_ALARM_HYSTERESIS_FIRST 0x022AU
#define MODBUS_ALARM_INTERNAL_ENABLE 0x022EU
#define MODBUS_ALARM_EXTERNAL_ENABLE 0x022FU
#define MODBUS_ALARM_QUALIFIED_ENABLE 0x0230U
#define MODBUS_ALARM_STATE 0x0231U
#define MODBUS_ALARM_STABLE 0x0232U
#define MODBUS_ALARM_ACTIVE 0x0233U
#define MODBUS_ALARM_GREEN_ACTIVE 0x0234U
#define MODBUS_ALARM_YELLOW_ACTIVE 0x0235U
#define MODBUS_ALARM_RED_ACTIVE 0x0236U
#define MODBUS_ALARM_INTERNAL_ACTIVE 0x0237U
#define MODBUS_ALARM_EXTERNAL_ACTIVE 0x0238U
#define MODBUS_ALARM_CONFIG_REVISION_FIRST 0x0239U
#define MODBUS_ALARM_CONFIG_DIRTY 0x023BU
#define MODBUS_ALARM_STAGING_VALIDATION 0x0251U
#define MODBUS_ALARM_STAGING_DIRTY 0x0252U
#define MODBUS_STARTUP_ZERO_FIRST 0x0260U
#define MODBUS_STARTUP_ZERO_LAST 0x0269U
#define MODBUS_STARTUP_ZERO_STATE 0x0260U
#define MODBUS_STARTUP_ZERO_ENABLED_AT_BOOT 0x0261U
#define MODBUS_STARTUP_ZERO_TERMINAL 0x0262U
#define MODBUS_STARTUP_ZERO_LAST_RESULT 0x0263U
#define MODBUS_STARTUP_ZERO_ELAPSED_FIRST 0x0264U
#define MODBUS_STARTUP_ZERO_ELAPSED_LAST 0x0265U
#define MODBUS_STARTUP_ZERO_GROSS_FIRST 0x0266U
#define MODBUS_STARTUP_ZERO_GROSS_LAST 0x0269U
#if defined(A33_ENABLE_STAGE5MR5_BETA) && (A33_ENABLE_STAGE5MR5_BETA != 0U)
/* Engineering-only extension. It is not part of frozen public Map 0x0104. */
#define MODBUS_R5_BETA_FIRST 0x0280U
#define MODBUS_R5_BETA_LAST 0x02A7U
#define MODBUS_R5_BETA_SIGNATURE 0x0280U
#define MODBUS_R5_BETA_APPLICATION 0x0281U
#define MODBUS_R5_BETA_MODE 0x0282U
#define MODBUS_R5_BETA_STATE 0x0283U
#define MODBUS_R5_BETA_LIMITED 0x0284U
#define MODBUS_R5_BETA_REASON 0x0285U
#define MODBUS_R5_BETA_OFFSET_FIRST 0x0286U
#define MODBUS_R5_BETA_UNCOMPENSATED_FIRST 0x028AU
#define MODBUS_R5_BETA_CORRECTED_FIRST 0x028EU
#define MODBUS_R5_BETA_REFERENCE_FIRST 0x0292U
#define MODBUS_R5_BETA_CURRENT_FIRST 0x0296U
#define MODBUS_R5_BETA_ERROR_FIRST 0x029AU
#define MODBUS_R5_BETA_RATE_FIRST 0x029EU
#define MODBUS_R5_BETA_HOLDOFF 0x02A0U
#define MODBUS_R5_BETA_REFERENCE_FILL 0x02A1U
#define MODBUS_R5_BETA_OBSERVATION_FILL 0x02A2U
#define MODBUS_R5_BETA_REBASE_FIRST 0x02A3U
#define MODBUS_R5_BETA_EVALUATION_FIRST 0x02A5U
#endif
#define MODBUS_EXECUTE_VALUE 0xA55AU

#endif
